
{
  "recipes":[
      {
          "id": 33525,
          "name": "Spiced Chickpea Stew With Coconut and Turmeric",
          "slug": "1019772-spiced-chickpea-stew-with-coconut-and-turmeric",
          "image_path": "https://imgs.search.brave.com/YXH5xm89Gj3apZ5f1p9xpsfDUlG0wO0dWeXWLuaR_8Y/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9pbWFn/ZXMuc3F1YXJlc3Bh/Y2UtY2RuLmNvbS9j/b250ZW50L3YxLzU0/MWIxNTE1ZTRiMGE5/OTBiMzNhNzk2ZS8x/NjExNDI0NjAwNDY3/LTI1RTBGUDFCWExS/S0NZUjY2SE5DL2Fs/aXNvbi1yb21hbi1z/cGljZWQtY2hpY2tw/ZWEtc3Rldy13aXRo/LWNvY29udXQtYW5k/LXR1cm1lcmljLmpw/Zw",
          "description": "Spiced chickpeas are crisped in olive oil, then simmered in a garlicky coconut milk for an insanely creamy, basically-good-for-you stew that evokes stews found in South India and parts of the Caribbean. While the chickpeas alone would be good as a side dish, they are further simmered with stock, bolstered with dark, leafy greens of your choosing and finished with a handful of fresh mint. When shopping, be sure to avoid low-fat coconut milk, coconut milk meant for drinking or cream of coconut: All are very different and would not be suitable here.",
          "total_time_string": "55 minutes",
          "servings": "4 to 6 servings",
          "rating_value": 5,
          "rating_count": 24216,
          "ingredients": [
              "1/4 cup olive oil, plus more for serving",
              "4 garlic cloves, chopped",
              "1 large yellow onion, chopped",
              "1 (2-inch) piece ginger, finely chopped",
              " Kosher salt and black pepper",
              "1 1/2 teaspoons ground turmeric, plus more for serving",
              "1 teaspoon red-pepper flakes, plus more for serving",
              "2 (15-ounce) cans chickpeas, drained and rinsed",
              "2 (15-ounce) cans full-fat coconut milk",
              "2 cups vegetable or chicken stock",
              "1 bunch Swiss chard, kale or collard greens, stems removed, torn into bite-size pieces",
              "1 cup mint leaves, for serving",
              " Yogurt, for serving (optional)",
              " Toasted pita, lavash or other flatbread, for serving (optional)"
          ],
          "instructions": [
              "Heat 1/4 cup oil in a large pot over medium. Add garlic, onion and ginger. Season with salt and pepper, and cook, stirring occasionally until onion is translucent and starts to brown a little at the edges, 3 to 5 minutes.",
              "Add 1 1/2 teaspoons turmeric, 1 teaspoon red-pepper flakes, and the chickpeas, and season with salt and pepper. Cook, stirring frequently, so the chickpeas sizzle and fry a bit in the spices and oil, until they’ve started to break down and get a little browned and crisp, 8 to 10 minutes. Remove about a cup of chickpeas and set aside for garnish.",
              "Using a wooden spoon or spatula, further crush the remaining chickpeas slightly to release their starchy insides. (This will help thicken the stew.) Add coconut milk and stock, and season with salt and pepper.",
              "Bring to a simmer, scraping up any bits that have formed on the bottom of the pot. Cook, stirring occasionally, until stew has thickened, 30 to 35 minutes. (Taste a chickpea or two, not just the liquid, to make sure they have simmered long enough to be as delicious as possible.) If after 30 to 35 minutes, you want the stew a bit thicker, keep simmering until you've reached your desired consistency. Determining perfect stew thickness is a personal journey!",
              "Add greens and stir, making sure they’re submerged in the liquid. Cook until they wilt and soften, 3 to 7 minutes, depending on what you’re using. (Swiss chard and spinach will wilt and soften much faster than kale or collard greens.) Season again with salt and pepper.",
              "Divide among bowls and top with mint, reserved chickpeas, a sprinkle of red-pepper flakes and a good drizzle of olive oil. Serve alongside yogurt and toasted pita if using; dust the yogurt with turmeric if you'd like."
          ],
          "author": "Alison Roman",
          "date_added": "2020-12-06",
          "categories": [
              8931,
              8741,
              9075,
              5492,
              8743,
              8902,
              9019,
              5496,
              5497,
              5470,
              5552,
              9094,
              5436,
              5437,
              5501,
              5502
          ]
      },
      {
          "id": 36707,
          "name": "Marcella Hazan’s Bolognese Sauce",
          "slug": "1015181-marcella-hazans-bolognese-sauce",
          "image_path": "https://imgs.search.brave.com/bBeMEgXmY8txzYM7iAdnkPpM2yRtLjMs3xtFOhEoYNg/rs:fit:860:0:0/g:ce/aHR0cHM6Ly93d3cu/Zm9vZGFuZHdpbmUu/Y29tL3RobWIvZm14/S3dGZFdVVmd0UnJu/VGZ3NzJkaFNsa2NF/PS8xNTAweDAvZmls/dGVyczpub191cHNj/YWxlKCk6bWF4X2J5/dGVzKDE1MDAwMCk6/c3RyaXBfaWNjKCkv/RkFXLXJlY2lwZXMt/Ym9sb2duZXNlLW1l/YXQtc2F1Y2UtaW5n/cmVkaWVudHMtZWUz/ODBmZGJiNTNjNGRk/NGEyNWU3MzNiMTVj/Y2I5ZjMuanBn",
          "description": "After the death in 2013 of Marcella Hazan, the cookbook author who changed the way Americans cook Italian food, The Times asked readers which of her recipes had become staples in their kitchens. Many people answered with one word: “Bolognese.” Ms. Hazan had a few recipes for the classic sauce, and they are all outstanding. This one appeared in her book “Essentials of Classic Italian Cooking,” and one reader called it “the gold standard.” Try it and see for yourself.",
          "total_time_string": "At least 4 hours",
          "servings": "2 heaping cups, for about 6 servings and 1 1/2 pounds pasta",
          "rating_value": 5,
          "rating_count": 22617,
          "ingredients": [
              "1 tablespoon vegetable oil",
              "3 tablespoons butter plus 1 tablespoon for tossing the pasta",
              "1/2 cup chopped onion",
              "2/3 cup chopped celery",
              "2/3 cup chopped carrot",
              "3/4 pound ground beef chuck (or you can use 1 part pork to 2 parts beef)",
              " Salt",
              " Black pepper, ground fresh from the mill",
              "1 cup whole milk",
              " Whole nutmeg",
              "1 cup dry white wine",
              "1 1/2 cups canned imported Italian plum tomatoes, cut up, with their juice",
              "1 1/4 to 1 1/2 pounds pasta",
              " Freshly grated parmigiano-reggiano cheese at the table"
          ],
          "instructions": [
              "Put the oil, butter and chopped onion in the pot and turn the heat on to medium. Cook and stir the onion until it has become translucent, then add the chopped celery and carrot. Cook for about 2 minutes, stirring vegetables to coat them well.",
              "Add ground beef, a large pinch of salt and a few grindings of pepper. Crumble the meat with a fork, stir well and cook until the beef has lost its raw, red color.",
              "Add milk and let it simmer gently, stirring frequently, until it has bubbled away completely. Add a tiny grating -- about 1/8 teaspoon -- of nutmeg, and stir.",
              "Add the wine, let it simmer until it has evaporated, then add the tomatoes and stir thoroughly to coat all ingredients well. When the tomatoes begin to bubble, turn the heat down so that the sauce cooks at the laziest of simmers, with just an intermittent bubble breaking through to the surface. Cook, uncovered, for 3 hours or more, stirring from time to time. While the sauce is cooking, you are likely to find that it begins to dry out and the fat separates from the meat. To keep it from sticking, add 1/2 cup of water whenever necessary. At the end, however, no water at all must be left and the fat must separate from the sauce. Stir to mix the fat into the sauce, taste and correct for salt.",
              "Toss with cooked drained pasta, adding the tablespoon of butter, and serve with freshly grated Parmesan on the side."
          ],
          "author": "The New York Times, Marcella Hazan",
          "date_added": "2020-12-06",
          "categories": [
              9909,
              5492,
              8932,
              8858,
              5464,
              5497,
              8808,
              8727,
              5534,
              5546
          ]
      },
      {
          "id": 35056,
          "name": "Oven-Roasted Chicken Shawarma",
          "slug": "1017161-oven-roasted-chicken-shawarma",
          "image_path": "https://imgs.search.brave.com/vKq_tV5fzdv4kgdQBdCz_IlVMSTdQKN6VPd9heO-9mg/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDIz/LzAzLzE5L211bHRp/bWVkaWEvU1MtT3Zl/bi1Sb2FzdGVkLUNo/aWNrZW4tU2hhd2Fy/bWEtcGhtdC9TUy1P/dmVuLVJvYXN0ZWQt/Q2hpY2tlbi1TaGF3/YXJtYS1waG10LWFy/dGljbGVMYXJnZS5q/cGc_d2lkdGg9MTI4/MCZxdWFsaXR5PTc1/JmF1dG89d2VicA",
          "description": "Here is a recipe for an oven-roasted version of the flavorful street-side classic usually cooked on a rotisserie. It is perfect for an evening with family and friends. Serve with pita and tahini, chopped cucumbers and tomatoes, some olives, chopped parsley, some feta, fried eggplant, hummus swirled with harissa, rice or rice pilaf. You can make the white sauce that traditionally accompanies it by cutting plain yogurt with mayonnaise and lemon juice, and flecking it with garlic. For a red to offset it, simmer ketchup with crushed red pepper and a hit of red-wine vinegar until it goes syrupy and thick, or just use your favorite hot sauce instead.",
          "total_time_string": "45 minutes, plus marinating",
          "servings": "4 to 6 servings",
          "rating_value": 5,
          "rating_count": 19941,
          "ingredients": [
              "2 lemons, juiced",
              "1/2 cup plus 1 tablespoon olive oil",
              "6 cloves garlic, peeled, smashed and minced",
              "1 teaspoon kosher salt",
              "2 teaspoons freshly ground black pepper",
              "2 teaspoons ground cumin",
              "2 teaspoons paprika",
              "1/2 teaspoon turmeric",
              " A pinch ground cinnamon",
              " Crushed red pepper, to taste",
              "2 pounds boneless, skinless chicken thighs",
              "1 large red onion, peeled and quartered",
              "2 tablespoons chopped fresh parsley"
          ],
          "instructions": [
              "Prepare a marinade for the chicken. Combine the lemon juice, 1/2 cup olive oil, garlic, salt, pepper, cumin, paprika, turmeric, cinnamon and crushed red pepper in a large bowl, then whisk to combine. Add the chicken and toss well to coat. Cover and store in refrigerator for at least 1 hour and up to 12 hours.",
              "When ready to cook, heat oven to 425 degrees. Use the remaining tablespoon of olive oil to grease a rimmed sheet pan. Add the quartered onion to the chicken and marinade, and toss once to combine. Remove the chicken and onion from the marinade, and place on the pan, spreading everything evenly across it.",
              "Put the chicken in the oven and roast until it is browned, crisp at the edges and cooked through, about 30 to 40 minutes. Remove from the oven, allow to rest 2 minutes, then slice into bits. (To make the chicken even more crisp, set a large pan over high heat, add a tablespoon of olive oil to the pan, then the sliced chicken, and sauté until everything curls tight in the heat.)",
              "Scatter the parsley over the top and serve with tomatoes, cucumbers, pita, white sauce, hot sauce, olives, fried eggplant, feta, rice — really anything you desire."
          ],
          "author": "Sam Sifton",
          "date_added": "2020-12-06",
          "categories": [
              8729,
              5492,
              8769,
              5421,
              9012,
              5496,
              5497,
              8802,
              5539,
              5486
          ]
      },
      {
          "id": 54773,
          "name": "Red Lentil Soup",
          "slug": "1016062-red-lentil-soup",
          "image_path": "https://imgs.search.brave.com/X5LYgtcO80r0Y1G1FGzpr-h9t5v-rTR3JCfrmG6Ky48/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDE5/LzAxLzE3L2Rpbmlu/Zy9tYy1yZWQtbGVu/dGlsLXNvdXAvbWVy/bGluXzE0NjIzNDM1/Ml9kN2JjODQ4Ni1i/MDY3LTRjZmYtYTRj/MC03NzQxZjE2NmZi/NjAtYXJ0aWNsZUxh/cmdlLmpwZz93aWR0/aD0xMjgwJnF1YWxp/dHk9NzUmYXV0bz13/ZWJw",
          "description": "This is a lentil soup that defies expectations of what lentil soup can be. Based on a Turkish lentil soup, mercimek corbasi, it is light, spicy and a bold red color (no murky brown here): a revelatory dish that takes less than an hour to make. The cooking is painless. Sauté onion and garlic in oil, then stir in tomato paste, cumin and chile powder and cook a few minutes more to intensify flavor. Add broth, water, red lentils (which cook faster than their green or black counterparts) and diced carrot, and simmer for 30 minutes. Purée half the mixture and return it to the pot for a soup that strikes the balance between chunky and pleasingly smooth. A hit of lemon juice adds an up note that offsets the deep cumin and chile flavors.",
          "total_time_string": null,
          "servings": "4 servings",
          "rating_value": 5,
          "rating_count": 19501,
          "ingredients": [
              "3 tablespoons olive oil, plus more for drizzling",
              "1 large onion, chopped",
              "2 garlic cloves, minced",
              "1 tablespoon tomato paste",
              "1 teaspoon ground cumin",
              "1/4 teaspoon kosher salt (such as Diamond Crystal), plus more to taste",
              "1/4 teaspoon black pepper",
              " Pinch of chili powder or cayenne, plus more to taste",
              "1 quart chicken or vegetable broth",
              "1 cup red lentils",
              "1 large carrot, peeled and diced",
              " Juice of ½ lemon, more to taste",
              "3 tablespoons chopped fresh cilantro"
          ],
          "instructions": [
              "In a large pot, heat 3 tablespoons oil over high until hot and shimmering. Add onion and garlic, and sauté until golden, about 4 minutes.",
              "Stir in tomato paste, cumin, salt, black pepper and chili powder, and sauté for 2 minutes longer.",
              "Add broth, 2 cups water, lentils and carrot. Bring to a simmer, then partly cover pot and turn heat to medium-low. Simmer until lentils are soft, about 30 minutes. Taste and add salt if necessary.",
              "Using an immersion or regular blender or a food processor, purée half the soup, then add it back to pot. The soup should be somewhat chunky.",
              "Reheat soup if necessary, then stir in lemon juice and cilantro. Serve soup drizzled with good olive oil and dusted lightly with chili powder, if desired."
          ],
          "author": "Melissa Clark",
          "date_added": "2023-01-16",
          "categories": [
              5488,
              10354,
              5493,
              8713,
              9480,
              5496,
              5498,
              9745,
              8992
          ]
      },
      {
          "id": 52678,
          "name": "No-Knead Bread",
          "slug": "11376-no-knead-bread",
          "image_path": "https://imgs.search.brave.com/zZi4Fp5m5KDtw3Z60vIjHUArkAAdsxJ81ggbGLGa9ec/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDIw/LzA0LzE2L2Rpbmlu/Zy9tYi1uby1rbmVh/ZC1icmVhZC1jb3B5/L21iLW5vLWtuZWFk/LWJyZWFkLWFydGlj/bGVMYXJnZS5qcGc_/d2lkdGg9MTI4MCZx/dWFsaXR5PTc1JmF1/dG89d2VicA",
          "description": "Here is one of the most popular recipes The Times has ever published, courtesy of Jim Lahey, owner of Sullivan Street Bakery. It requires no kneading. It uses no special ingredients, equipment or techniques. And it takes very little effort — only time. You will need 24 hours to create the bread, but much of this is unattended waiting, a slow fermentation of the dough that results in a perfect loaf. (We've updated the recipe to reflect <a href=\"https://www.nytimes.com/2006/12/06/dining/06mini.html\">changes Mark Bittman made</a> to the recipe in 2006 after publishing and receiving reader feedback. The original recipe called for 3 cups flour; we've adjusted it to call for 3 1/3 cups/430 grams flour.) <a href=\"/#/recipe/1022147-updated-no-knead-bread\">In 2021, J. Kenji López-Alt revisited the recipe and shared his own tweaked version.</a>",
          "total_time_string": "1 hour 30 minutes, plus about 20 hours' resting time",
          "servings": "One 1 1/2-pound loaf",
          "rating_value": 5,
          "rating_count": 19348,
          "ingredients": [
              "3 1/3 cups/430 grams all-purpose or bread flour, plus more for dusting",
              " Generous 1/4 teaspoon/1 gram instant yeast",
              "2 teaspoons/8 grams kosher salt",
              " Cornmeal or wheat bran, as needed"
          ],
          "instructions": [
              "In a large bowl combine flour, yeast and salt. Add 1 1/2 cups/345 grams water and stir until blended; dough will be shaggy and sticky. Cover bowl with plastic wrap. Let dough rest at least 12 hours, preferably about 18, at warm room temperature, about 70 degrees.",
              "Dough is ready when its surface is dotted with bubbles. Lightly flour a work surface and place dough on it; sprinkle it with a little more flour and fold it over on itself once or twice. Cover loosely with plastic wrap and let rest about 15 minutes.",
              "Using just enough flour to keep dough from sticking to work surface or to your fingers, gently and quickly shape dough into a ball. Generously coat a cotton towel (not terry cloth) with flour, wheat bran or cornmeal; put dough seam side down on towel and dust with more flour, bran or cornmeal. Cover with another cotton towel and let rise for about 2 hours. When it is ready, dough will be more than double in size and will not readily spring back when poked with a finger.",
              "At least a half-hour before dough is ready, heat oven to 450 degrees. Put a 6- to 8-quart heavy covered pot (cast iron, enamel, Pyrex or ceramic) in oven as it heats. When dough is ready, carefully remove pot from oven. Slide your hand under towel and turn dough over into pot, seam side up; it may look like a mess, but that is OK. Shake pan once or twice if dough is unevenly distributed; it will straighten out as it bakes. Cover with lid and bake 30 minutes, then remove lid and bake another 15 to 30 minutes, until loaf is beautifully browned. Cool on a rack."
          ],
          "author": "Mark Bittman, Jim Lahey",
          "date_added": "2020-12-06",
          "categories": [
              9039,
              9048,
              5506,
              9189,
              5493,
              9480,
              9596,
              9012,
              8809,
              5499,
              5557
          ]
      },
      {
          "id": 32913,
          "name": "Crisp Gnocchi With Brussels Sprouts and Brown Butter",
          "slug": "1020453-crisp-gnocchi-with-brussels-sprouts-and-brown-butter",
          "image_path": "https://imgs.search.brave.com/U60f7_6sCV_GRAI96nMZfa14FCfItENFk8Xgw4fFT4c/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDI0/LzA0LzIzL211bHRp/bWVkaWEvaGV3LWNh/YmJhZ2UtYnVjYXRp/bmlyZXgtcHFtdC9o/ZXctY2FiYmFnZS1i/dWNhdGluaXJleC1w/cW10LW1lZGl1bVRo/cmVlQnlUd280NDAu/anBnP3dpZHRoPTEy/ODAmcXVhbGl0eT03/NSZhdXRvPXdlYnA",
          "description": "For a fantastic meal that can be ready in 20 minutes, toss together seared gnocchi and sautéed brussels sprouts with lemon zest, red-pepper flakes and brown butter. The key to this recipe is how you cook the store-bought gnocchi: No need to boil. Just sear them until they are crisp and golden on the outside, and their insides will stay chewy. The resulting texture is reminiscent of fried dough. Shelf-stable and refrigerated gnocchi will both work here, but the shelf-stable ones do crisp up a bit better.",
          "total_time_string": "20 minutes",
          "servings": "4 servings",
          "rating_value": 5,
          "rating_count": 17909,
          "ingredients": [
              "1 pound brussels sprouts (or cruciferous vegetables like broccoli, cauliflower or even cabbage)",
              "1 lemon",
              "4 tablespoons extra-virgin olive oil",
              " Kosher salt (such as Diamond Crystal) and black pepper",
              "1/2 teaspoon red-pepper flakes",
              "1 (18-ounce) package shelf-stable or refrigerated potato gnocchi",
              "6 tablespoons unsalted butter, sliced into 6 pieces",
              "1/2 teaspoon honey",
              " Freshly grated Parmesan, for serving"
          ],
          "instructions": [
              "Trim and halve the brussels sprouts. Using a vegetable peeler, peel thick strips of lemon zest, then coarsely chop. (You should have about 2 teaspoons chopped zest.)",
              "In a large (preferably 12-inch) skillet, heat 3 tablespoons olive oil over medium-high. Add the brussels sprouts, season with 1/2 teaspoon salt and a few grinds of pepper, then arrange the brussels sprouts in an even layer, cut side down. Scatter the lemon zest over the top and cook, undisturbed, until the brussels sprouts are well browned underneath, 3 to 5 minutes. Add the red-pepper flakes, stir and cook until the brussels sprouts are crisp-tender, 2 to 3 minutes. Transfer to a medium bowl.",
              "In the same skillet, heat the remaining 1 tablespoon olive oil over medium-high. Break up any gnocchi that are stuck together, add them to the pan and cook, covered and undisturbed, until golden brown on one side, 2 to 4 minutes. Add the butter and honey, season with salt and a generous amount of black pepper, and cook, stirring, until the butter is golden, nutty smelling and foaming, 1 to 2 minutes. Stir in the brussels sprouts until warmed through. Serve with grated Parmesan."
          ],
          "author": "Ali Slagle",
          "date_added": "2020-12-06",
          "categories": [
              8840,
              8878,
              5492,
              5493,
              8715,
              8920,
              9012,
              5496,
              5497,
              5534,
              5498,
              9499,
              5558,
              5501,
              5502,
              8716
          ]
      },
      {
          "id": 40133,
          "name": "Red Lentil Soup With Lemon",
          "slug": "1016062-red-lentil-soup-with-lemon",
          "image_path": "https://imgs.search.brave.com/_19bGpOe7EeaoXMzktW0SWrwcEI2kA6ElwVJUPkRFPE/rs:fit:500:0:0/g:ce/aHR0cHM6Ly9ncmVl/bnZhbGxleWtpdGNo/ZW4uY29tL3dwLWNv/bnRlbnQvdXBsb2Fk/cy8yMDE0LzExL1Jl/ZC1MZW50aWwtQ2Fy/cm90LVNvdXAuanBn",
          "description": "This is a lentil soup that defies expectations of what lentil soup can be. Based on a Turkish lentil soup, mercimek corbasi, it is light, spicy and a bold red color (no murky brown here): a revelatory dish that takes less than an hour to make. The cooking is painless. Sauté onion and garlic in oil, then stir in tomato paste, cumin and chile powder and cook a few minutes more to intensify flavor. Add broth, water, red lentils (which cook faster than their green or black counterparts) and diced carrot, and simmer for 30 minutes. Purée half the mixture and return it to the pot for a soup that strikes the balance between chunky and pleasingly smooth. A hit of lemon juice adds an up note that offsets the deep cumin and chile flavors.",
          "total_time_string": null,
          "servings": "4 servings",
          "rating_value": 5,
          "rating_count": 17746,
          "ingredients": [
              "3 tablespoons olive oil, more for drizzling",
              "1 large onion, chopped",
              "2 garlic cloves, minced",
              "1 tablespoon tomato paste",
              "1 teaspoon ground cumin",
              "1/4 teaspoon kosher salt, more to taste",
              "1/4 teaspoon ground black pepper",
              " Pinch of ground chile powder or cayenne, more to taste",
              "1 quart chicken or vegetable broth",
              "2 cups water",
              "1 cup red lentils",
              "1 large carrot, peeled and diced",
              " Juice of 1/2 lemon, more to taste",
              "3 tablespoons chopped fresh cilantro"
          ],
          "instructions": [
              "In a <a href='https://www.nytimes.com/wirecutter/reviews/best-dutch-oven/'>large pot</a>, heat 3 tablespoons oil over high heat until hot and shimmering. Add onion and garlic, and sauté until golden, about 4 minutes.",
              "Stir in tomato paste, cumin, salt, black pepper and chili powder or cayenne, and sauté for 2 minutes longer.",
              "Add broth, 2 cups water, lentils and carrot. Bring to a simmer, then partially cover pot and turn heat to medium-low. Simmer until lentils are soft, about 30 minutes. Taste and add salt if necessary.",
              "Using an immersion or regular blender or a food processor, purée half the soup then add it back to pot. Soup should be somewhat chunky.",
              "Reheat soup if necessary, then stir in lemon juice and cilantro. Serve soup drizzled with good olive oil and dusted lightly with chili powder if desired."
          ],
          "author": "Melissa Clark",
          "date_added": "2020-12-06",
          "categories": [
              5488,
              10354,
              5492,
              5493,
              8713,
              5496,
              5497,
              5498,
              9745,
              8992,
              5552,
              5502
          ]
      },
      {
          "id": 32571,
          "name": "Caramelized Shallot Pasta",
          "slug": "1020830-caramelized-shallot-pasta",
          "image_path": "https://imgs.search.brave.com/dM2OEjxlOtOBY9SGm_WrCmpfpgzLotBUbrKKpeBqlnQ/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDIw/LzAxLzI5L2Rpbmlu/Zy8yN1JvbWFucmV4/L21lcmxpbl8xNjcw/NzkxNzRfZWNjMDMy/ZTctMDcxYi00NGFi/LTg4NTItMGQ1MDI1/ZDBlOTBkLWFydGlj/bGVMYXJnZS5qcGc_/d2lkdGg9MTI4MCZx/dWFsaXR5PTc1JmF1/dG89d2VicA",
          "description": "This pasta is all about the shallots, cooked down in a bath of olive oil to a jammy, caramelized paste. Tomato paste is there for tanginess, and anchovies for saltiness, but they serve more as background flavors to the sweetness of the shallot. This recipe makes enough caramelized shallot mixture for a double batch of pasta, or simply keep it refrigerated to spoon over fried eggs, or to serve underneath crispy chicken thighs or over roasted root vegetables like carrots or sweet potatoes.",
          "total_time_string": "40 minutes",
          "servings": "4 servings",
          "rating_value": 5,
          "rating_count": 17121,
          "ingredients": [
              "1/4 cup olive oil",
              "6 large shallots, very thinly sliced",
              "5 garlic cloves, 4 thinly sliced, 1 finely chopped",
              " Kosher salt and freshly ground black pepper",
              "1 teaspoon red-pepper flakes, plus more to taste",
              "1 (2-ounce) can anchovy fillets (about 12), drained",
              "1 (4.5-ounce) tube or (6-ounce) can of tomato paste (about 1/2 to 3/4 cup)",
              "10 ounces pasta",
              "1 cup parsley, leaves and tender stems, finely chopped",
              " Flaky sea salt"
          ],
          "instructions": [
              "Heat olive oil in a large heavy-bottomed <a href='https://www.nytimes.com/wirecutter/reviews/best-dutch-oven/'>Dutch oven</a> over medium high. Add shallots and thinly sliced garlic, and season with salt and pepper. Cook, stirring occasionally, until the shallots have become totally softened and caramelized with golden-brown fried edges, 15 to 20 minutes.",
              "Add red-pepper flakes and anchovies. (No need to chop the anchovies; they will dissolve on their own.) Stir to melt the anchovies into the shallots, about 2 minutes.",
              "Add tomato paste and season with salt and pepper. Cook, stirring constantly to prevent any scorching, until the tomato paste has started to cook in the oil a bit, caramelizing at the edges and going from bright red to a deeper brick red color, about 2 minutes. Remove from heat and transfer about half the mixture to a resealable container, leaving the rest behind. (These are your leftovers to be used elsewhere: in another batch of pasta or smeared onto roasted vegetables, spooned over fried eggs or spread underneath crispy chicken thighs.)",
              "To serve, cook pasta according to package instructions in a large pot of salted boiling water until very al dente (perhaps more al dente than usual). Transfer to Dutch oven with remaining shallot mixture (or a skillet if you are using the leftover portion) and 1 cup pasta water. Cook over medium-high heat, swirling the skillet to coat each piece of pasta, using a wooden spoon or spatula to scrape up any bits on the bottom, until pasta is thick and sauce has reduced and is sticky, but not saucy, 3 to 5 minutes.",
              "In a small bowl, combine parsley and finely chopped garlic clove, and season with flaky salt and pepper. Divide pasta among bowls, or transfer to one large serving bowl, and top with parsley mixture and a bit more red-pepper flakes, if you like."
          ],
          "author": "Alison Roman",
          "date_added": "2020-12-06",
          "categories": [
              8942,
              5492,
              9189,
              5497,
              8727,
              5534,
              8847,
              9190,
              5501
          ]
      },
      {
          "id": 41021,
          "name": "Old-Fashioned Beef Stew",
          "slug": "4735-old-fashioned-beef-stew",
          "image_path": "https://imgs.search.brave.com/15bogVpzgABfEEHF97ACUoS4k43pItySscsHm6o4cNE/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9pbnNh/bmVseWdvb2RyZWNp/cGVzLmNvbS93cC1j/b250ZW50L3VwbG9h/ZHMvMjAyMC8xMS9X/YXJtLWFuZC1IZWFy/dHktSG9tZW1hZGUt/T2xkLUZhc2hpb25l/ZC1CZWVmLVN0ZXct/d2l0aC1WZWdldGFi/bGVzLWFuZC1CcmVh/ZC04MDB4NTMwLmpw/Zw",
          "description": "This classic stick-to-your-ribs stew is the ideal project for a chilly weekend. Beef, onion, carrots, potatoes and red wine come together in  cozy harmony. If you are feeding a crowd, good news: It doubles (or triples) beautifully.",
          "total_time_string": null,
          "servings": "4 servings",
          "rating_value": 5,
          "rating_count": 16965,
          "ingredients": [
              "1/4 cup all-purpose flour",
              "1/4 teaspoon freshly ground pepper",
              "1 pound beef stewing meat, trimmed and cut into inch cubes",
              "5 teaspoons vegetable oil",
              "2 tablespoons red wine vinegar",
              "1 cup red wine",
              "3 1/2 cups beef broth, homemade or low-sodium canned",
              "2 bay leaves",
              "1 medium onion, peeled and chopped",
              "5 medium carrots, peeled and cut into 1/4-inch rounds",
              "2 large baking potatoes, peeled and cut into 3/4-inch cubes",
              "2 teaspoons salt"
          ],
          "instructions": [
              "Combine the flour and pepper in a bowl, add the beef and toss to coat well. Heat 3 teaspoons of the oil in a <a href='https://www.nytimes.com/wirecutter/reviews/best-dutch-oven/'>large pot</a>. Add the beef a few pieces at a time; do not overcrowd. Cook, turning the pieces until beef is browned on all sides, about 5 minutes per batch; add more oil as needed between batches.",
              "Remove the beef from the pot and add the vinegar and wine. Cook over medium-high heat, scraping the pan with a wooden spoon to loosen any browned bits. Add the beef, beef broth and bay leaves. Bring to a boil, then reduce to a slow simmer.",
              "Cover and cook, skimming broth from time to time, until the beef is tender, about 1 1/2 hours. Add the onions and carrots and simmer, covered, for 10 minutes. Add the potatoes and simmer until vegetables are tender, about 30 minutes more. Add broth or water if the stew is dry. Season with salt and pepper to taste. Ladle among 4 bowls and serve."
          ],
          "author": "Molly O'Neill",
          "date_added": "2020-12-06",
          "categories": [
              9284,
              8930,
              5492,
              8715,
              5497,
              5531,
              8939,
              5552
          ]
      },
      {
          "id": 32753,
          "name": "Thai-Inspired Chicken Meatball Soup",
          "slug": "1020631-thai-inspired-chicken-meatball-soup",
          "image_path": "https://imgs.search.brave.com/1aK_NuIDAgIvtsNQk2cWjkeqIni8QhOQPcfB2PZQhwY/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDE5/LzExLzEzL2Rpbmlu/Zy9hcy10aGFpLWNo/aWNrZW4tbWVhdGJh/bGwtc291cC9tZXJs/aW5fMTY0MzMxMjg4/X2Y3MzA0YjM3LTNi/ZDctNGE4ZC05ZDNm/LWQ3NWFiZGY0ZGYy/OS1hcnRpY2xlTGFy/Z2UuanBnP3dpZHRo/PTEyODAmcXVhbGl0/eT03NSZhdXRvPXdl/YnA",
          "description": "This stellar soup is reviving and cozy, made in one pot, and ready in 30 minutes. It starts with ginger-scented chicken-cilantro meatballs that are browned, then simmered in a fragrant coconut milk broth that’s inspired by tom kha gai, a Thai chicken-coconut soup seasoned with lemongrass, galangal, makrut lime leaves and chile. A heap of spinach is added for color and flavor, and a squeeze of lime adds brightness and punch. The soup is brothy, so serve it over rice or another grain to make it a full meal.",
          "total_time_string": "30 minutes",
          "servings": "4 to 6 servings",
          "rating_value": 5,
          "rating_count": 16833,
          "ingredients": [
              "1 (4-inch) piece fresh ginger, peeled",
              "6 garlic cloves, peeled",
              "1 jalapeño",
              "2 pounds ground chicken",
              "1 large bunch cilantro, leaves and stems finely chopped, a few whole leaves reserved for serving",
              "3 tablespoons fish sauce",
              " Kosher salt",
              "2 tablespoons vegetable or coconut oil, plus more as needed",
              "2 cups chicken broth",
              "1 (14-ounce) can full-fat coconut milk",
              "1/2 teaspoon granulated sugar",
              "5 ounces baby spinach",
              "1 tablespoon lime juice, plus lime wedges for serving",
              " Steamed white or brown rice, for serving"
          ],
          "instructions": [
              "Using the small holes of a box grater, or a Microplane, grate the ginger, garlic and jalapeño (or finely chop them by hand). Transfer half to a large bowl and set the rest aside. To the large bowl, add the chicken, finely chopped cilantro, 2 tablespoons fish sauce and 1 teaspoon salt. Use your hands or a fork to fully combine but do not overmix.",
              "Use your hands or an ice cream scoop to form 2-inch meatballs (about 2 ounces each). In a large Dutch oven or pot, heat the oil over medium-high heat. Working in batches, add the meatballs in a single layer and cook, flipping halfway through, until golden brown on two sides, 5 to 8 minutes. Transfer to a plate and repeat, adding oil as needed.",
              "Once all the meatballs are browned and out of the pot, if the oil is burned, wipe it out and add a bit more to the pot. Reduce the heat to medium, add the reserved ginger mixture and sauté until fragrant, about 1 minute. Add the chicken broth, coconut milk, sugar and the remaining 1 tablespoon fish sauce, and bring to a simmer. Add the meatballs and any juices from the plate, and simmer until the flavors come together and the meatballs are cooked through, 5 to 8 minutes.",
              "Remove from heat, and stir in the spinach and lime juice. Divide rice among bowls, then top with meatballs, broth and cilantro. Serve with lime wedges."
          ],
          "author": "Ali Slagle",
          "date_added": "2020-12-06",
          "categories": [
              9069,
              8741,
              5492,
              9189,
              5493,
              8796,
              8793,
              8743,
              8976,
              9012,
              9107,
              5496,
              5497,
              5531,
              5539,
              8992,
              5552,
              8889,
              5484,
              5501
          ]
      },
      {
          "id": 35058,
          "name": "Shakshuka With Feta",
          "slug": "1014721-shakshuka-with-feta",
          "image_path": "https://imgs.search.brave.com/Hxs3EuGKq_s8gUqXl10dgPstqf1mYkPKXYhWnNvVtR0/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDIz/LzA1LzAzL211bHRp/bWVkaWEvTUMtU2hh/a3NodWthLXdpdGgt/RmV0YTIvMDNNT1NU/U0FWRUQtUm91bmR1/cC1TaGFrc2h1a2Et/d2l0aC1GZXRhMi16/aHdtLWFydGljbGVM/YXJnZS5qcGc_d2lk/dGg9MTI4MCZxdWFs/aXR5PTc1JmF1dG89/d2VicA",
          "description": "Shakshuka may be at the apex of eggs-for-dinner recipes, though in Israel it is breakfast food, a bright, spicy start to the day with a pile of pita or challah served on the side. (It also makes excellent brunch or lunch food.) It’s a one-skillet recipe of eggs baked in a tomato-red pepper sauce spiced with cumin, paprika and cayenne. First you make that sauce, which comes together fairly quickly on top of the stove, then you gently crack each of the eggs into the pan, nestling them into the sauce. The pan is moved into the oven to finish. Shakshuka originated in North Africa, and like many great dishes there are as many versions as there are cooks who have embraced it. This one strays from more traditional renditions by adding crumbled feta cheese, which softens into creamy nuggets in the oven’s heat.",
          "total_time_string": "50 minutes",
          "servings": "4 to 6 servings",
          "rating_value": 5,
          "rating_count": 16725,
          "ingredients": [
              "3 tablespoons extra-virgin olive oil",
              "1 large onion, halved and thinly sliced",
              "1 large red bell pepper, seeded and thinly sliced",
              "3 garlic cloves, thinly sliced",
              "1 teaspoon ground cumin",
              "1 teaspoon sweet paprika",
              "1/8 teaspoon ground cayenne, or to taste",
              "1 (28-ounce) can whole plum tomatoes with their juices, coarsely chopped",
              "3/4 teaspoon kosher salt, plus more as needed",
              "1/4 teaspoon black pepper, plus more as needed",
              "5 ounces feta, crumbled (about 1 1/4 cups)",
              "6 large eggs",
              " Chopped cilantro, for serving",
              " Hot sauce, for serving"
          ],
          "instructions": [
              "Heat oven to 375 degrees. Heat oil in a large skillet over medium-low. Add onion and bell pepper. Cook gently until very soft, about 20 minutes. Add garlic and cook until tender, 1 to 2 minutes; stir in cumin, paprika and cayenne, and cook 1 minute. Pour in tomatoes and season with 3/4 teaspoon salt and 1/4 teaspoon pepper; simmer until tomatoes have thickened, about 10 minutes. Taste and add more salt and pepper if needed. Stir in crumbled feta.",
              "Gently crack eggs into skillet over tomatoes. Season eggs with salt and pepper. Transfer skillet to oven and bake until eggs are just set, 7 to 10 minutes. Sprinkle with cilantro and serve with hot sauce."
          ],
          "author": "Melissa Clark",
          "date_added": "2020-12-06",
          "categories": [
              5489,
              5490,
              9909,
              5492,
              5493,
              8807,
              9216,
              8826,
              5466,
              5426,
              5496,
              5497,
              9106,
              9499,
              5437,
              5502
          ]
      },
      {
          "id": 41078,
          "name": "Turkey Chili",
          "slug": "7985-turkey-chili",
          "image_path": "https://imgs.search.brave.com/jql5tpAkW2Fz4A-CzsAW-GWIk7gePyp5Mc06idmjC64/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDIz/LzAxLzI5L211bHRp/bWVkaWEvMjlzb3Vw/cmV4LWNoaWxpLS1x/Zmp6LzI5c291cHJl/eC1jaGlsaS0tcWZq/ei1hcnRpY2xlTGFy/Z2UuanBnP3dpZHRo/PTEyODAmcXVhbGl0/eT03NSZhdXRvPXdl/YnA",
          "description": "You might not think of chili as an easy weeknight dish, but this turkey version from Pierre Franey will change your mind. It's fabulous, it's healthy and it can be cooked in about a half hour. A combination of dark and white meat really adds depth and richness of flavor, so try to find a mix, but all white meat (or a mixture of ground beef and turkey) will yield a stellar batch too.",
          "total_time_string": "1 hour",
          "servings": "About 6 servings",
          "rating_value": 5,
          "rating_count": 16422,
          "ingredients": [
              "1 tablespoon olive oil",
              "2 pounds ground turkey, white and dark meat combined",
              "2 cups coarsely chopped onions",
              "2 tablespoons chopped garlic",
              "1 large sweet red pepper, cored, deveined and coarsely chopped",
              "1 cup chopped celery",
              "1 jalapeño, cored, deveined and finely chopped",
              "1 tablespoon fresh oregano, chopped, or 1 tablespoon dried",
              "2 bay leaves",
              "3 tablespoons chili powder",
              "2 teaspoons ground cumin",
              "3 cups canned diced tomatoes",
              "2 cups chicken broth, fresh or canned",
              " Salt and black pepper",
              "2 (15-ounce) cans red kidney beans, drained",
              "2 cups shredded Cheddar",
              "1 cup sour cream (optional)",
              " Sliced lime, for garnish (optional)"
          ],
          "instructions": [
              "Heat the oil over high in a large heavy pot and add the turkey meat. Cook until lightly browned, about 5 minutes, chopping down and stirring with the side of a heavy kitchen spoon to break up any lumps.",
              "Add the onions, garlic, sweet pepper, celery, jalapeño, oregano, bay leaves, chili powder and cumin. Stir to blend well. Cook for 5 minutes.",
              "Add the tomatoes, chicken broth, salt and pepper to taste. Bring to a boil, reduce heat and simmer, stirring occasionally, for 15 minutes.",
              "Add the drained beans and cook, stirring occasionally, for 10 minutes longer. Serve in bowls with Cheddar, and sour cream and lime wedges, if desired."
          ],
          "author": "Pierre Franey",
          "date_added": "2020-12-06",
          "categories": [
              9318,
              9385,
              9862,
              5492,
              8715,
              9480,
              9261,
              10176,
              5497,
              9062,
              9276,
              5540,
              5499,
              5502
          ]
      },
      {
          "id": 32457,
          "name": "Turmeric-Black Pepper Chicken With Asparagus",
          "slug": "1020970-turmeric-black-pepper-chicken-with-asparagus",
          "image_path": "https://static01.nyt.com/images/2020/03/26/dining/as-turmeric-chicken/merlin_170459076_be9517b6-6c9d-47f1-bb27-843d6c777088-articleLarge.jpg?width=1024&quality=75&auto=webp",
          "description": "In this sweet and spicy stir-fry, black pepper, honey and rice vinegar help accentuate turmeric’s delightfully earthy qualities. Thinly sliced asparagus doesn’t need much time to cook, but feel free to swap with any other vegetables that cook in just a few minutes, like thinly sliced green beans, frozen peas or baby spinach. Serve this with rice or rice vermicelli noodles, or tuck it into a lettuce cup or pita with yogurt and fresh herbs. You could also trade the chicken for tofu, shrimp or cubed pork shoulder.",
          "total_time_string": "15 minutes",
          "servings": "4 servings",
          "rating_value": 5,
          "rating_count": 15958,
          "ingredients": [
              "3 tablespoons honey",
              "3/4 teaspoon black pepper, plus more to taste",
              " Kosher salt (such as Diamond Crystal)",
              "2 tablespoons all-purpose flour",
              "1 1/2 teaspoons ground turmeric",
              "1 pound boneless, skinless chicken thighs, cut into 1-inch pieces",
              "1 tablespoon coconut or canola oil",
              "12 ounces asparagus, trimmed and thinly sliced on an angle",
              "1 teaspoon unseasoned rice vinegar or soy sauce",
              "1 lime, cut into wedges (optional)"
          ],
          "instructions": [
              "In a small bowl or measuring cup, stir together 1/4 cup water with the honey, pepper and 1/2 teaspoon salt; set honey mixture aside.",
              "In a medium bowl, stir together the flour, turmeric and 1 teaspoon salt. Add the chicken and toss until coated.",
              "In a medium (10-inch) nonstick skillet, heat the oil over medium-high. Add the chicken and cook until the turmeric is fragrant and the chicken is golden brown on both sides, 2 to 3 minutes per side. Add the asparagus, season with salt, stir to combine and cook until crisp-tender, 1 to 2 minutes.",
              "Add the honey mixture and cook, stirring, until the chicken is cooked through and the sauce has thickened, 2 to 3 minutes.",
              "Remove from heat and stir in the vinegar. Season to taste with salt and pepper. Serve with lime squeezed over top, if you like."
          ],
          "author": "Ali Slagle",
          "date_added": "2020-12-06",
          "categories": [
              8721,
              9376,
              8729,
              5492,
              8902,
              8789,
              9012,
              5497,
              5539,
              5498,
              9412,
              8782,
              5558,
              5501,
              5502
          ]
      },
      {
          "id": 36256,
          "name": "Roberta’s Pizza Dough",
          "slug": "1016230-robertas-pizza-dough",
          "image_path": "https://imgs.search.brave.com/b8utvqog8lj_8gvqnB_8WSS5BdIOaZ1LZ_TCHAfhhcQ/rs:fit:500:0:0/g:ce/aHR0cHM6Ly9pbWFn/ZXMuc3F1YXJlc3Bh/Y2UtY2RuLmNvbS9j/b250ZW50L3YxLzVk/NWE3ODY4NDg4OTA4/MDAwMWU4NDEwNy8x/NTg1NDk2MTMzNzQ0/LTlLQTJJRVo0VlVS/UVZJNjRFNzhML3B1/YmxpYy5qcGVn",
          "description": "This recipe, adapted from Roberta’s, the pizza and hipster haute-cuisine utopia in Bushwick, Brooklyn, provides a delicate, extraordinarily flavorful dough that will last in the refrigerator for up to a week. It rewards close attention to weight rather than volume in the matter of the ingredients, and asks for a mixture of finely ground Italian pizza flour (designated “00” on the bags and available in some supermarkets, many specialty groceries and always online) and regular all-purpose flour. As ever with breads, rise time will depend on the temperature and humidity of your kitchen and refrigerator.\n\n<a href=\"http://cooking.nytimes.com/68861692-nyt-cooking/807163-our-greatest-pizza-recipes\">Our Greatest Pizza Recipes</a>",
          "total_time_string": "20 minutes plus at least 3 hours' rising",
          "servings": "Two 12-inch pizzas",
          "rating_value": 5,
          "rating_count": 15583,
          "ingredients": [
              "153 grams 00 flour (1 cup plus 1 tablespoon)",
              "153 grams all-purpose flour (1 cup plus 1 tablespoon and 2 teaspoons)",
              "8 grams fine sea salt (1 teaspoon)",
              "2 grams active dry yeast (3/4 teaspoon)",
              "4 grams extra-virgin olive oil (1 teaspoon)"
          ],
          "instructions": [
              "In a large mixing bowl, combine flours and salt.",
              "In a small mixing bowl, stir together 200 grams (a little less than 1 cup) lukewarm tap water, the yeast and the olive oil, then pour it into flour mixture. Knead with your hands until well combined, approximately 3 minutes, then let the mixture rest for 15 minutes.",
              "Knead rested dough for 3 minutes. Cut into 2 equal pieces and shape each into a ball. Place on a heavily floured surface, cover with dampened cloth, and let rest and rise for 3 to 4 hours at room temperature or for 8 to 24 hours in the refrigerator. (If you refrigerate the dough, remove it 30 to 45 minutes before you begin to shape it for pizza.)",
              "To make pizza, place each dough ball on a heavily floured surface and use your fingers to stretch it, then your hands to shape it into rounds or squares. Top and bake."
          ],
          "author": "Sam Sifton, Carlo Mirarchi, Brandon Hoy, Chris Parachini, Katherine Wheelock",
          "date_added": "2020-12-06",
          "categories": [
              9047,
              5492,
              9975,
              5464,
              9012,
              5496,
              5497,
              5538,
              8809
          ]
      },
      {
          "id": 35554,
          "name": "Roasted Salmon Glazed With Brown Sugar and Mustard",
          "slug": "1017244-roasted-salmon-glazed-with-brown-sugar-and-mustard",
          "image_path": "https://imgs.search.brave.com/PTXzLgqZq8sBPCLM_fHX1DmCGyjz4Uadte-5Xw_vF5A/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDIx/LzAyLzA3L2Rpbmlu/Zy9zaWZ0b24tYnJv/d24tc3VnYXItbXVz/dGFyZC1zYWxtb24t/aG9yaXpvbnRhbC9t/ZXJsaW5fMTQyNDI3/NzU0Xzg3YmUwNjBm/LTY0OGUtNDc4My1h/OWFiLWRlYzFmZjEy/YjcyMi1hcnRpY2xl/TGFyZ2UuanBnP3dp/ZHRoPTEyODAmcXVh/bGl0eT03NSZhdXRv/PXdlYnA",
          "description": "This is what we call around here a no-recipe recipe, the sort of meal you can cook once off a card and you'll know it by heart: salmon glazed with brown sugar and mustard. The preparation could not be simpler. Heat your oven to 400. Make a mixture of Dijon mustard and brown sugar to the degree of spicy-sweetness that pleases you. Salt and pepper the salmon fillets. Place them skin-side down on a lightly oiled, foil-lined baking sheet, slather the tops with the mustard and brown sugar glaze and slide them into the top half of your oven. They ought to be done in 12 minutes or so, and they pair beautifully with <a href=\"/#/recipe/6165-braised-greens \">simple braised greens</a>.",
          "total_time_string": "15 minutes",
          "servings": "Number of servings vary",
          "rating_value": 5,
          "rating_count": 15089,
          "ingredients": [
              " Salmon fillets, preferably wild or farmed organically",
              " Dijon mustard",
              " Brown sugar",
              " Salt and black pepper"
          ],
          "instructions": [
              "Heat your oven to 400 degrees.",
              "Make a mixture of Dijon mustard and brown sugar to the degree of spicy-sweetness that pleases you. Salt and pepper the salmon fillets.",
              "Place the salmon fillets skin-side down on a lightly oiled, foil-lined baking sheet. Slather the tops of the fillets with the mustard and brown sugar glaze and slide them into the top half of your oven. Roast for about 12 minutes, then serve."
          ],
          "author": "Sam Sifton",
          "date_added": "2020-12-06",
          "categories": [
              8987,
              5420,
              8730,
              5492,
              5493,
              5494,
              5495,
              5421,
              5423,
              5425,
              9012,
              9020,
              5430,
              5496,
              5497,
              5498,
              8792,
              5548,
              5501,
              5502
          ]
      },
      {
          "id": 52690,
          "name": "Sheet-Pan Baked Feta With Broccolini, Tomatoes and Lemon",
          "slug": "1021277-sheet-pan-baked-feta-with-broccolini-tomatoes-and-lemon",
          "image_path": "https://imgs.search.brave.com/lsrdi5p_dOU3zEbI7WDNx4lW_lmOXUow0V9ROC70GZo/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9hc3Nl/dHMuZXBpY3VyaW91/cy5jb20vcGhvdG9z/LzY0ZDIxMjNkMDIz/YWQ4YjQxMTIwNzA5/My8xOjEvcGFzcy91/bmRlZmluZWQ",
          "description": "When baked, feta gains an almost creamy texture, similar to goat cheese but with feta’s characteristic tang. In this easy vegetarian sheet-pan dinner, broccolini (or broccoli), grape tomatoes and lemon slices roast alongside the feta until the broccolini crisp, the tomatoes burst and the lemon rinds soften. (Remember, broccolini has a tender, delicious stalk so only the bottom 1/2-inch needs to be trimmed.) Serve this dish over a pile of orzo for a complete meal. If you like, cut the broccolini, feta and lemon into bite-size pieces and toss with the orzo.",
          "total_time_string": "25 minutes",
          "servings": "4 servings",
          "rating_value": 5,
          "rating_count": 14228,
          "ingredients": [
              "1 bunch broccolini, ends trimmed, thick stalks split lengthwise, or broccoli, stalks trimmed and cut into bite-size pieces",
              "1 pint grape tomatoes, halved (about 2 cups)",
              "1 small red onion, peeled, quartered and cut into 2-inch wedges",
              "1 lemon, 1/2 cut into thin rounds and the remaining 1/2 left intact, for serving",
              "3 tablespoons olive oil, plus more for serving",
              "1 teaspoon ground cumin",
              "1/2 teaspoon red-pepper flakes",
              " Kosher salt and black pepper",
              "2 (6- to 8-ounce) blocks feta, cut into 1-inch slices",
              " Cooked orzo or farro, for serving",
              "1/2 cup fresh basil or cilantro leaves and fine stems, roughly chopped (optional)"
          ],
          "instructions": [
              "Heat the oven to 400 degrees with a rack set in the lower third. On a sheet pan, combine the broccolini, tomatoes, onion and lemon slices with the olive oil and toss. Add cumin and red-pepper flakes, season with salt and pepper, and toss again until evenly coated. Nestle the feta slices into the vegetables. (It’s OK if they break apart a little.)",
              "Roast 15 to 20 minutes, stirring halfway through but leaving the feta in place, until the broccolini is charred at the tips, the stems are easily pierced with a fork and the tomato skins start to blister and break down.",
              "Serve over orzo or farro. Drizzle with olive oil and serve with the remaining lemon half for squeezing. Top with fresh herbs, if using."
          ],
          "author": "Yasmin Fahr",
          "date_added": "2020-12-06",
          "categories": [
              9315,
              10020,
              8742,
              5492,
              5493,
              8715,
              8826,
              9538,
              8884,
              5496,
              5497,
              5531,
              9476,
              5498,
              8915,
              8916,
              5499,
              8921,
              5558,
              5437,
              5502
          ]
      },
      {
          "id": 33032,
          "name": "Shrimp Scampi With Orzo",
          "slug": "1020330-shrimp-scampi-with-orzo",
          "image_path": "https://imgs.search.brave.com/DVLL17BrPRdz2bgWvfXopGlsStsQuQEZAUeZSzeX4uA/rs:fit:860:0:0/g:ce/aHR0cHM6Ly93d3cu/Z2ltbWVzb21lb3Zl/bi5jb20vd3AtY29u/dGVudC91cGxvYWRz/LzIwMTQvMDEvU2hy/aW1wLVNjYW1waS0z/LmpwZw",
          "description": "The universal appeal of shrimp scampi, frankly, isn’t the shrimp but the pan sauce: garlicky butter lightened with white wine and bursts of lemon, parsley and red-pepper flakes. Scampi is often tossed with pasta or served with crusty bread, but this version instead uses quick-cooking orzo. It simmers directly in the pan sauce, imparting a starchy gloss — and soaking up the garlicky scampi flavors. Toss the shrimp with some garlic, lemon zest and red-pepper flakes to marinate while the pasta gets a head start on the stove, then simply toss the shrimp on top of the orzo to steam. It all comes together in a flash, and feels effortless. Pair this dish with Caesar salad, steamed broccoli or arugula, or bask in its simple comfort, straight from a spoon.",
          "total_time_string": "25 minutes",
          "servings": "4 servings",
          "rating_value": 5,
          "rating_count": 13579,
          "ingredients": [
              "1 pound large shrimp, peeled and deveined",
              "3 tablespoons extra-virgin olive oil",
              "1 tablespoon lemon zest, plus 1 tablespoon juice (from 1 lemon)",
              "1/2 teaspoon red-pepper flakes",
              " Kosher salt (such as Diamond Crystal) and black pepper",
              "4 garlic cloves, minced",
              "2 tablespoons unsalted butter",
              "1 cup orzo",
              "1/3 cup dry white wine",
              "2 cups boiling water, seafood stock or chicken stock",
              "3 tablespoons finely chopped parsley"
          ],
          "instructions": [
              "In a medium bowl, stir together shrimp, 1 tablespoon olive oil, lemon zest, red-pepper flakes, 1/2 teaspoon salt, 1/4 teaspoon pepper and half of the garlic. Set aside to marinate. (This step can be done up to 1 hour in advance.)",
              "Add butter, remaining olive oil and remaining garlic to a medium skillet set over medium heat. When the butter starts to bubble, add the orzo and 1/2 teaspoon salt and cook, stirring often, until the orzo is toasted, about 2 minutes, adjusting the heat as necessary to prevent the garlic from burning. Carefully add the wine — it will bubble — and stir until absorbed, about 1 minute. Stir in water, reduce heat to low, cover, and cook until orzo is al dente, about 12 minutes.",
              "Add the shrimp in a snug, even layer on top of the orzo, cover, and cook until all the shrimp is pink and cooked through, 2 to 4 minutes. Remove from heat and let sit, covered, 2 minutes.",
              "Sprinkle with parsley and lemon juice, season with salt and pepper, and serve immediately."
          ],
          "author": "Ali Slagle",
          "date_added": "2020-12-06",
          "categories": [
              5439,
              5492,
              8932,
              5493,
              9508,
              9012,
              5497,
              5531,
              9476,
              5534,
              5498,
              5548,
              8786,
              9499
          ]
      },
      {
          "id": 41197,
          "name": "Original Plum Torte",
          "slug": "3783-original-plum-torte",
          "image_path": "https://imgs.search.brave.com/oVCyo2Cl5PbY8zsGg4ZxuxwmGS-n2KZcNt-TbA3tVes/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDIz/LzA5LzA2L211bHRp/bWVkaWEvTUItUGx1/bS1Ub3J0ZS13a3Zx/L01CLVBsdW0tVG9y/dGUtd2t2cS1hcnRp/Y2xlTGFyZ2UuanBn/P3dpZHRoPTEyODAm/cXVhbGl0eT03NSZh/dXRvPXdlYnA",
          "description": "The Times published Marian Burros’s recipe for Plum Torte every September from 1983 until 1989, when the editors determined that enough was enough.  The recipe was to be printed for the last time that year. “To counter anticipated protests,” Ms. Burros wrote a few years later, “the recipe was printed in larger type than usual with a broken-line border around it to encourage clipping.” It didn’t help. The paper was flooded with angry letters. “The appearance of the recipe, like the torte itself, is bittersweet,” wrote a reader in Tarrytown, N.Y. “Summer is leaving, fall is coming. That's what your annual recipe is all about. Don't be grumpy about it.” We are not! And we pledge that every year, as summer gives way to fall, we will make sure that the recipe is easily available to one and all. The original 1983 recipe called for 1 cup sugar; the 1989 version reduced that to 3/4 cup. We give both options below. Here are <a href=\" http://www.nytimes.com/interactive/2016/09/14/dining/marian-burros-plum-torte-recipe-variations.html\">five ways to adapt the torte</a>.",
          "total_time_string": "1 hour 15 minutes",
          "servings": "8 servings",
          "rating_value": 5,
          "rating_count": 13425,
          "ingredients": [
              "3/4 to 1 cup sugar",
              "1/2 cup unsalted butter, softened",
              "1 cup unbleached flour, sifted",
              "1 teaspoon baking powder",
              " Pinch of salt (optional)",
              "2 eggs",
              "24 halves pitted purple plums",
              " Sugar, lemon juice and cinnamon, for topping"
          ],
          "instructions": [
              "Heat oven to 350 degrees.",
              "Cream the sugar and butter in a bowl. Add the flour, baking powder, salt and eggs and beat well.",
              "Spoon the batter into a springform pan of 8, 9 or 10 inches. Place the plum halves skin side up on top of the batter. Sprinkle lightly with sugar and lemon juice, depending on the sweetness of the fruit. Sprinkle with about 1 teaspoon of cinnamon, depending on how much you like cinnamon.",
              "Bake 1 hour, approximately. Remove and cool; refrigerate or freeze if desired. Or cool to lukewarm and serve plain or with whipped cream. (To serve a torte that was frozen, defrost and reheat it briefly at 300 degrees.)"
          ],
          "author": "Marian Burros",
          "date_added": "2020-12-06",
          "categories": [
              5489,
              5490,
              5509,
              5491,
              5493,
              9480,
              8818,
              5433,
              9472,
              8748,
              8724,
              5557,
              5437,
              5501,
              5502
          ]
      },
      {
          "id": 40507,
          "name": "Creamy Macaroni and Cheese",
          "slug": "1015825-creamy-macaroni-and-cheese",
          "image_path": "https://imgs.search.brave.com/JXhuFaPXq4x0ceNq38a9_veI450mVr3xfWSuxMAKCzo/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDIx/LzExLzEwL2Rpbmlu/Zy8wNE1BQ1JFWC9t/ZXJsaW5fMTk2OTU2/MzMzXzAyY2MyNDA3/LWU3YzEtNDY5Yy04/ODBmLTZkMDIyZjk3/NTkzYy1hcnRpY2xl/TGFyZ2UuanBnP3dp/ZHRoPTEyODAmcXVh/bGl0eT03NSZhdXRv/PXdlYnA",
          "description": "There are two schools of thought about macaroni and cheese: Some like it crusty and extra-cheesy (<a href=\"/#/recipe/1015824-baked-macaroni-and-cheese\">here’s our recipe</a>), while others prefer it smooth and creamy. But most people are delighted by any homemade macaroni and cheese. It is light years ahead of the boxed versions. This creamy version has one powerful advantage for the cook: There’s no need to preboil the pasta. It cooks in the oven, absorbing the liquid from the dairy products.",
          "total_time_string": null,
          "servings": "6 to 8 servings",
          "rating_value": 5,
          "rating_count": 13164,
          "ingredients": [
              "2 tablespoons unsalted butter",
              "1 cup cottage cheese (not low-fat)",
              "2 cups milk (not skim)",
              "1 teaspoon dry mustard",
              " Pinch of ground cayenne",
              " Pinch of ground nutmeg",
              "1/2 teaspoon kosher salt",
              "1/4 teaspoon black pepper",
              "1 pound sharp or extra-sharp Cheddar, grated",
              "1/2 pound elbow pasta, uncooked"
          ],
          "instructions": [
              "Heat oven to 375 degrees and position an oven rack in upper third of oven. Use 1 tablespoon butter to grease a 9-inch round or square baking pan.",
              "In a blender, purée cottage cheese, milk, mustard, cayenne, nutmeg and salt and pepper. Reserve 1/4 cup grated Cheddar for topping. In a large bowl, combine remaining grated Cheddar, milk mixture and uncooked pasta. Pour into prepared pan, cover tightly with foil and bake 30 minutes.",
              "Uncover pan, stir gently, sprinkle with reserved cheese and dot with remaining tablespoon butter. Bake, uncovered, 30 minutes more, until browned. Let cool at least 15 minutes before serving."
          ],
          "author": "Julia Moskin",
          "date_added": "2020-12-06",
          "categories": [
              5439,
              5490,
              5511,
              8717,
              9677,
              5492,
              5493,
              5496,
              9620,
              5497,
              8805,
              10711,
              5499,
              8719,
              5501,
              5502,
              8716
          ]
      },
      {
          "id": 32620,
          "name": "Red Curry Lentils With Sweet Potatoes and Spinach",
          "slug": "1020766-red-curry-lentils-with-sweet-potatoes-and-spinach",
          "image_path": "https://imgs.search.brave.com/yB7Co6jIE-7VUXnd5Lfh05CdTNtHz0_fJO5q-VrlpOo/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDIz/LzA5LzEzL211bHRp/bWVkaWEvUEsteW9n/dXJ0LXJpY2UtY2p3/cS9QSy15b2d1cnQt/cmljZS1jandxLW1l/ZGl1bVRocmVlQnlU/d280NDAuanBnP3dp/ZHRoPTEyODAmcXVh/bGl0eT03NSZhdXRv/PXdlYnA",
          "description": "In this vegetarian main inspired by Indian dal, lentils are cooked with an aromatic blend of Thai spices — fresh ginger, turmeric, red curry paste and chile — then simmered in coconut milk until fall-apart tender. Browning the sweet potatoes before cooking them with the lentils brings out their sweetness, balancing the heat from the chile and curry paste, while baby spinach tossed in just before serving adds fresh flavor. Serve over steamed white or brown rice, or with toasted flatbread on the side.",
          "total_time_string": "1 hour",
          "servings": "4 to 6 servings",
          "rating_value": 5,
          "rating_count": 13015,
          "ingredients": [
              "3 tablespoons olive oil",
              "1 pound sweet potatoes (about 2 medium sweet potatoes), peeled and cut into 3/4-inch cubes",
              "1 medium yellow onion, chopped",
              "3 tablespoons Thai red curry paste",
              "3 garlic cloves, minced (about 1 tablespoon)",
              "1 (1-inch) piece fresh ginger, peeled and grated (about 1 tablespoon)",
              "1 red chile, such as Fresno or serrano, halved, seeds and ribs removed, then minced",
              "1 teaspoon ground turmeric",
              "1 cup red lentils, rinsed",
              "4 cups low-sodium vegetable stock",
              "2 teaspoons kosher salt, plus more to taste",
              "1 (13-ounce) can full-fat coconut milk",
              "1 (4- to 5-ounce) bag baby spinach",
              "1/2 lime, juiced",
              " Fresh cilantro leaves, for serving",
              " Toasted unsweetened coconut flakes, for serving (optional)"
          ],
          "instructions": [
              "In a Dutch oven or pot, heat 2 tablespoons olive oil over medium-high. Add the sweet potatoes and cook, stirring occasionally, until browned all over, 5 to 7 minutes. Transfer the browned sweet potatoes to a plate and set aside.",
              "Add the remaining 1 tablespoon olive oil to the pot and set the heat to medium-low. Add the onion and cook, stirring occasionally, until translucent, 4 to 6 minutes. Add the curry paste, garlic, ginger, chile and turmeric, and cook until fragrant, about 1 minute.",
              "Add the lentils, stock, salt and browned sweet potatoes to the pot and bring to a boil over high. Lower the heat and simmer, uncovered, stirring occasionally, until the lentils are just tender, 20 to 25 minutes.",
              "Add the coconut milk and simmer, stirring occasionally, until the liquid has reduced and the lentils are creamy and falling apart, 15 to 20 minutes.",
              "Add the spinach and stir until just wilted, 2 to 3 minutes. Off the heat, stir in the lime juice and season with salt to taste.",
              "Divide among shallow bowls and top with cilantro and coconut flakes, if using."
          ],
          "author": "Lidey Heuck",
          "date_added": "2020-12-06",
          "categories": [
              5505,
              8741,
              5492,
              9189,
              5493,
              9701,
              5497,
              5531,
              9593,
              9745,
              8889,
              8917,
              9013,
              5436,
              5558,
              5437
          ]
      },
      {
          "id": 34066,
          "name": "Salted Chocolate Chunk Shortbread Cookies",
          "slug": "1019152-salted-chocolate-chunk-shortbread-cookies",
          "image_path": "https://imgs.search.brave.com/p3jTbFLtov2QTq8UXgBXPTWIzJdSeWvfasGFZ5XH26c/rs:fit:860:0:0/g:ce/aHR0cHM6Ly90aGV2/aWV3ZnJvbWdyZWF0/aXNsYW5kLmNvbS93/cC1jb250ZW50L3Vw/bG9hZHMvMjAxNi8x/MS9jaG9jb2xhdGUt/aGF6ZWxudXQtZnVk/Z2UtMTQ0NC1Ob3Zl/bWJlci0wMy0yMDE2/LTMwMHgzMDAuanBn",
          "total_time_string": "45 minutes, plus chilling",
          "servings": "24 cookies",
          "rating_value": 5,
          "rating_count": 12660,
          "ingredients": [
              "1 cup plus 2 tablespoons/255 grams total salted butter (2¼ sticks), cold (room temperature if you're using a handheld mixer), cut into ½-inch pieces (see note)",
              "1/2 cup/100 grams granulated sugar",
              "1/4 cup/55 grams light brown sugar",
              "1 teaspoon vanilla extract",
              "2 1/2 cups/325 grams all-purpose flour (see Tip)",
              "6 ounces/170 grams semi-sweet or bittersweet dark chocolate, chopped (not too fine; you want chunks, not little shards)",
              "1 large egg, beaten",
              " Demerara sugar, for rolling",
              " Flaky sea salt, for sprinkling"
          ],
          "instructions": [
              "Line two rimmed baking sheets with parchment paper. Using a stand mixer fitted with the paddle attachment or an electric hand mixer, beat the butter, both sugars and vanilla on medium-high till it’s super light and fluffy (3 to 5 minutes for a stand mixer; 6 to 8 for a hand mixer). Using a spatula, scrape down the sides of the bowl and, with the mixer on low, slowly add the flour, followed by the chocolate chunks, and mix just to blend. If necessary, knead the dough with your hands to make sure the flour is totally incorporated. At this point, the dough should be smooth and feel like Play-Doh with no pockets of flour.",
              "Divide the dough in half, placing each half on a large piece of plastic wrap. Fold the plastic over so that it covers the dough to protect your hands from getting all sticky. Using your hands, form the dough into a log shape; rolling it on the counter will help you smooth it out, but don’t worry about getting it totally perfect. (Don't be afraid to make them compact. Shortbread is supposed to be dense. That's part of why it's so good.) You can also do this using parchment paper, if you prefer, but plastic wrap is easier when it comes to shaping the log. Each half should form a 6-inch log, 2 to 2¼ inches in diameter. Chill until totally firm, about 2 hours.",
              "Heat the oven to 350 degrees. Brush the outside of the logs with the beaten egg and roll them in the demerara sugar (this is for those really delicious, crisp edges).",
              "Using a serrated knife, carefully slice each log into ½-inch-thick rounds (if you hit a chocolate chunk, slowly saw back and forth through the chocolate). If the cookies break or fall apart, just press them back together — the dough is very forgiving. Place them on the prepared baking sheets about 1 inch apart (they won’t spread much). Sprinkle with flaky salt. Bake until the edges are just beginning to brown, 12 to 15 minutes. Let cool slightly before eating them all."
          ],
          "author": "Alison Roman",
          "date_added": "2020-12-06",
          "categories": [
              8998,
              8705,
              8717,
              8706,
              5515,
              9754,
              5491,
              9480,
              8812,
              8809,
              8763,
              8709,
              5500
          ]
      },
      {
          "id": 40072,
          "name": "Chocolate Chip Cookies",
          "slug": "1015819-chocolate-chip-cookies",
          "image_path": "https://imgs.search.brave.com/cYpmmYrl-6G_lSEC-bgEzAqph85FSV5kOF-2PYdYki0/rs:fit:500:0:0/g:ce/aHR0cHM6Ly90My5m/dGNkbi5uZXQvanBn/LzAyLzIwLzg3LzM0/LzM2MF9GXzIyMDg3/MzQyNV81NXZzRTRX/WkZ1OWNIZVRUZU80/SXF0aXFVQzNYS0Jw/Ry5qcGc",
          "description": "You may have memorized the foolproof gem on the back of the Toll House bag, given to the world by Ruth Graves Wakefield in the 1930s. But this may become your new favorite chocolate chip cookie recipe. It’s a little more complicated, and you’ll have to plan ahead: After assembling the dough, you must chill it for at least 24 hours before baking it, and preferably up to 36. This allows the dry ingredients time to soak up the wet ones, which results in a firmer dough. It leads to a marvelously chewy, chocolate-rich cookie. Don’t skimp on good chocolate, and the sea salt is not an option — it’s the beacon at the top of this gorgeous treat. (You can certainly put this recipe together by hand, but a stand mixer makes it easy work. If you’re in the market for one, our colleagues at The Wirecutter have tested quite a few, and they've put together <a href=\"https://www.nytimes.com/wirecutter/reviews/best-stand-mixer/\">an excellent guide to the best</a>.)",
          "total_time_string": null,
          "servings": "1 1/2 dozen 5-inch cookies",
          "rating_value": 5,
          "rating_count": 12552,
          "ingredients": [
              "2 cups minus 2 tablespoons cake flour (8 1/2 ounces)",
              "1 2/3 cups bread flour (8 1/2 ounces)",
              "1 1/4 teaspoons baking soda",
              "1 1/2 teaspoons baking powder",
              "1 1/2 teaspoons coarse salt",
              "1 1/4 cups unsalted butter (2 1/2 sticks)",
              "1 1/4 cups light brown sugar (10 ounces)",
              "1 cup plus 2 tablespoons granulated sugar (8 ounces)",
              "2 large eggs",
              "2 teaspoons natural vanilla extract",
              "1 1/4 pounds bittersweet chocolate disks or fèves, at least 60 percent cacao content (see note)",
              " Sea salt"
          ],
          "instructions": [
              "Sift flours, baking soda, baking powder and salt into a bowl. Set aside.",
              "Using a <a href='https://www.nytimes.com/wirecutter/reviews/best-stand-mixer/'>mixer</a> fitted with paddle attachment, cream butter and sugars together until very light, about 5 minutes. Add eggs, one at a time, mixing well after each addition. Stir in the vanilla. Reduce speed to low, add dry ingredients and mix until just combined, 5 to 10 seconds. Drop chocolate pieces in and incorporate them without breaking them. Press plastic wrap against dough and refrigerate for 24 to 36 hours. Dough may be used in batches, and can be refrigerated for up to 72 hours.",
              "When ready to bake, preheat oven to 350 degrees. Line a baking sheet with parchment paper or a nonstick baking mat. Set aside.",
              "Scoop 6 3 1/2-ounce mounds of dough (the size of generous golf balls) onto baking sheet, making sure to turn horizontally any chocolate pieces that are poking up; it will make for a more attractive cookie. Sprinkle lightly with sea salt and bake until golden brown but still soft, 18 to 20 minutes. Transfer sheet to a wire rack for 10 minutes, then slip cookies onto another rack to cool a bit more. Repeat with remaining dough, or reserve dough, refrigerated, for baking remaining batches the next day. Eat warm, with a big napkin."
          ],
          "author": "David Leite, Jacques Torres",
          "date_added": "2020-12-06",
          "categories": [
              8998,
              9048,
              8868,
              8705,
              5515,
              5491,
              8809,
              5500
          ]
      },
      {
          "id": 52985,
          "name": "Lemony White Bean Soup With Turkey and Greens",
          "slug": "1021776-lemony-white-bean-soup-with-turkey-and-greens",
          "image_path": "https://imgs.search.brave.com/mMaEaouhRRtf2jz-rCMIqMTTjST8_LVFx61mNKJMSGI/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9hc3Nl/dHMuZXBpY3VyaW91/cy5jb20vcGhvdG9z/LzYyZDZjNTEzMDc3/YTk1MmY0YThjMzM4/Yy8xOjEvcGFzcy91/bmRlZmluZWQ",
          "description": "Bright with lemon and herbs, and packed with hearty greens, this highly adaptable soup can be either light and brothy or thick and stewlike, depending on your preference. Smashing some of the beans to release their starch will give you a thicker soup that’s almost worthy of a fork. To keep it on the brothy side, add a little more liquid and leave the beans intact. Either way, it’s a warming, piquant, one-pot meal that’s perfect for winter.",
          "total_time_string": "45 minutes",
          "servings": "4 servings",
          "rating_value": 5,
          "rating_count": 12468,
          "ingredients": [
              "3 tablespoons olive oil",
              "1 large onion, diced",
              "1 large carrot, diced",
              "1 bunch sturdy greens, such as kale, broccoli rabe, mustard greens or collard greens",
              "1 tablespoon tomato paste",
              "3/4 teaspoon ground cumin, plus more to taste",
              "1/8 teaspoon red-pepper flakes, plus more to taste",
              "1/2 pound ground turkey",
              "3 garlic cloves, minced",
              "1 tablespoon finely grated fresh ginger",
              "1 teaspoon kosher salt, plus more to taste",
              "1 quart chicken stock",
              "2 (15-ounce) cans white beans, drained and rinsed",
              "1 cup chopped fresh, soft herbs, such as parsley, mint, dill, basil, tarragon, chives or a combination",
              " Fresh lemon juice, to taste"
          ],
          "instructions": [
              "Heat a large pot over medium-high for a minute or so to warm it up. Add the oil and heat until it thins out, about 30 seconds. Add onion and carrot, and sauté until very soft and brown at the edges, 7 to 10 minutes.",
              "Meanwhile, rinse the greens and pull the leaves off the stems. Tear or chop into bite-size pieces and set aside.",
              "When the onion is golden, add tomato paste, 3/4 teaspoon cumin and 1/8 teaspoon red-pepper flakes to the pot, and sauté until paste darkens, about 1 minute. Add turkey, garlic, ginger and 1 teaspoon salt, and sauté, breaking up the meat with your spoon, until turkey is browned in spots, 4 to 7 minutes.",
              "Add stock and beans, and bring to a simmer. Let simmer until the soup is thick and flavorful, adding more salt if needed, 15 to 25 minutes. If you like a thicker broth, you can smash some of the beans with the back of the spoon to release their starch. Or leave the beans whole for a brothier soup.",
              "Add the greens to the pot and simmer until they are very soft. This will take 5 to 10 minutes for most greens, but tough collard greens might take 15 minutes. (Add a little water if the broth gets too reduced.)",
              "Stir herbs and lemon juice into the pot, taste and add more salt, cumin and lemon until the broth is lively and bright-tasting. Serve topped with a drizzle of olive oil and more red-pepper flakes, if desired."
          ],
          "author": "Melissa Clark",
          "date_added": "2021-01-20",
          "categories": [
              5420,
              5492,
              5493,
              8715,
              8743,
              9261,
              5496,
              5497,
              5531,
              8934,
              8992,
              5552,
              9316,
              8723,
              8716
          ]
      },
      {
          "id": 35294,
          "name": "Best Gazpacho",
          "slug": "1017577-best-gazpacho",
          "image_path": "https://imgs.search.brave.com/VlA_zN9I3nX34CtsBStVgVGxQnSuD-WPWX9Sfhrswic/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDIx/LzA1LzIzL2Rpbmlu/Zy9qbS1nYXpwYWNo/by9tZXJsaW5fMTg3/NTM4MTkwXzRkYTBi/NDc2LWFlNjEtNDY0/My05Mzk3LWRmZTli/OTczNzRlNy1hcnRp/Y2xlTGFyZ2UuanBn/P3dpZHRoPTEyODAm/cXVhbGl0eT03NSZh/dXRvPXdlYnA",
          "description": "More of a drink than a soup, served in frosted glasses or chilled tumblers, gazpacho is perfect when it is too hot to eat but you need cold, salt and lunch all at the same time. Gazpacho is everywhere in Seville, Spain, where this recipe comes from, but it's not the watered-down salsa or grainy vegetable purée often served in the United States. This version has no bread and is a creamy orange-pink rather than a lipstick red. That is because a large quantity of olive oil is required for making delicious gazpacho, rather than take-it-or-leave it gazpacho. The emulsion of red tomato juice, palest green cucumber juice and golden olive oil produces the right color and a smooth, almost fluffy texture.",
          "total_time_string": "20 minutes plus chilling time",
          "servings": "8 to 12 servings, about 1 quart",
          "rating_value": 5,
          "rating_count": 12391,
          "ingredients": [
              " About 2 pounds ripe red tomatoes, cored and roughly cut into chunks",
              "1 Italian frying (cubanelle) pepper or another long, light green pepper, such as Anaheim, cored, seeded and roughly cut into chunks",
              "1 cucumber, about 8 inches long, peeled and roughly cut into chunks",
              "1 small mild onion (white or red), peeled and roughly cut into chunks",
              "1 clove garlic",
              "2 teaspoons sherry vinegar, more to taste",
              " Salt",
              "1/2 cup extra-virgin olive oil, more to taste, plus more for drizzling"
          ],
          "instructions": [
              "Combine tomatoes, pepper, cucumber, onion and garlic in a blender or, if using a hand blender, in a deep bowl. (If necessary, work in batches.) Blend at high speed until very smooth, at least 2 minutes, pausing occasionally to scrape down the sides with a rubber spatula.",
              "With the motor running, add the vinegar and 2 teaspoons salt. Slowly drizzle in the olive oil. The mixture will turn bright orange or dark pink and become smooth and emulsified, like a salad dressing. If it still seems watery, drizzle in more olive oil until texture is creamy.",
              "Strain the mixture through a strainer or a food mill, pushing all the liquid through with a spatula or the back of a ladle. Discard the solids. Transfer to a large pitcher (preferably glass) and chill until very cold, at least 6 hours or overnight.",
              "Before serving, adjust the seasonings with salt and vinegar. If soup is very thick, stir in a few tablespoons ice water. Serve in glasses, over ice if desired, or in a bowl. A few drops of olive oil on top are a nice touch."
          ],
          "author": "Julia Moskin",
          "date_added": "2020-12-06",
          "categories": [
              5488,
              8952,
              5492,
              5493,
              9097,
              11269,
              5496,
              8809,
              5498,
              8913,
              8992,
              5552,
              5483,
              11280,
              8724,
              8921,
              5502
          ]
      },
      {
          "id": 32581,
          "name": "Lemony Shrimp and Bean Stew",
          "slug": "1020828-lemony-shrimp-and-bean-stew",
          "image_path": "https://imgs.search.brave.com/7dxWrQk2t4bSqXp3lJQgEuJ1AUI2NvrJbAc5ktIwSSE/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDIw/LzA4LzA5L2Rpbmlu/Zy9zbC1zaHJpbXAt/YW5kLWJlYW4vc2wt/c2hyaW1wLWFuZC1i/ZWFuLWFydGljbGVM/YXJnZS12Mi5qcGc_/d2lkdGg9MTI4MCZx/dWFsaXR5PTc1JmF1/dG89d2VicA",
          "description": "With minimal prep and a quick cook time, this shrimp stew feels elegant for such an easy weeknight meal. You can also take the dish in a number of directions: Substitute the shrimp with an equal amount of flaky white fish or even seared scallops, or stretch the dish into a meal for six by stirring in some butter and serving over cooked spaghetti or rigatoni. A good glug of your best olive oil would also be a welcome.",
          "total_time_string": "30 minutes",
          "servings": "4 servings",
          "rating_value": 5,
          "rating_count": 12181,
          "ingredients": [
              "1 teaspoon fresh lemon zest and 2 tablespoons juice",
              "1 teaspoon sweet or smoked paprika",
              "2 garlic cloves, grated",
              " Kosher salt and black pepper",
              "1 pound peeled, deveined large shrimp (tails removed)",
              "4 tablespoons unsalted butter (1/2 stick)",
              "2 large leeks, trimmed, then halved lengthwise, white and light green parts sliced crosswise 1/2-inch thick (or 1 large onion, minced)",
              "1 (15-ounce) can cannellini beans or other white beans, rinsed",
              "2 cups chicken stock or vegetable stock",
              "2 tablespoons finely chopped fresh parsley (optional)",
              " Toasted bread, for serving (optional)"
          ],
          "instructions": [
              "Combine lemon zest, paprika, garlic, 3/4 teaspoon salt and 3/4 teaspoon pepper in a medium bowl. Add shrimp and toss to coat.",
              "In a large pot, melt butter over medium-high heat. When butter is foaming, add shrimp and cook, stirring occasionally, until pink and starting to curl, 2 to 3 minutes. Using a slotted spoon, transfer shrimp to a plate; set aside.",
              "Add leeks, season with salt and pepper, and cook over medium until leeks are soft and starting to brown on the edges, 4 to 5 minutes, stirring occasionally. Add beans and chicken broth and bring to a boil over high. Lower heat and simmer, 8 to 10 minutes. Stir in reserved shrimp and any juices from the plate, parsley and lemon juice, and season with salt and pepper. Serve with toasted bread."
          ],
          "author": "Sue Li",
          "date_added": "2020-12-06",
          "categories": [
              5439,
              5505,
              8725,
              5492,
              5493,
              8841,
              8790,
              5497,
              5531,
              5498,
              5548,
              8786,
              5558,
              5502
          ]
      },
      {
          "id": 42212,
          "name": "Jordan Marsh’s Blueberry Muffins",
          "slug": "2868-jordan-marshs-blueberry-muffins",
          "image_path": "https://imgs.search.brave.com/IN1od1yIuMv3iQSv3e_PIvz0dG6b5Er977c1o65fAIk/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9wZWFz/YW5kY3JheW9ucy5j/b20vd3AtY29udGVu/dC91cGxvYWRzLzIw/MjAvMDUvam9yZGFu/LW1hcnNoLWJsdWVi/ZXJyeS1tdWZmaW5z/LXJlY2lwZS01LTgw/MHgxMjAwLmpwZw",
          "description": "This recipe came to The Times in a 1987 article by Marian Burros, \"The Battle of the Blueberry Muffins.\" Two years prior, <a href=\"http://www.nytimes.com/1985/07/27/style/de-gustibus-muffins-are-a-special-way-to-enjoy-blueberries.html\">Ms. Burros wrote about a recipe for the muffins attributed to the Ritz-Carlton in Boston</a>. The hotel had adapted a recipe used by Gilchrist's, once one of city's best-known department stores. After it ran, a reader wrote in to say that the best blueberry muffins in Boston were not from the Ritz-Carlton, but from the now-closed Jordan Marsh department store. She sent along the recipe, with a description of how she picks wild blueberries: standing in a pond in the August heat and plucking berries from bushes along the bank. This version has a lot more sugar and butter and fewer eggs than the Ritz-Carlton muffins. The recipe also calls for mashing a half cup of berries and adding them to the batter. This produces a very moist muffin, one that will stay fresh longer.",
          "total_time_string": null,
          "servings": "12 muffins",
          "rating_value": 5,
          "rating_count": 12173,
          "ingredients": [
              "1/2 cup softened butter",
              "1 1/4 cups sugar",
              "2 eggs",
              "1 teaspoon vanilla extract",
              "2 cups flour",
              "1/2 teaspoon salt",
              "2 teaspoons baking powder",
              "1/2 cup milk",
              "2 cups blueberries, washed, drained and picked over",
              "3 teaspoons sugar"
          ],
          "instructions": [
              "Preheat the oven to 375.",
              "Cream the butter and 1 1/4 cups sugar until light.",
              "Add the eggs, one at a time, beating well after each addition. Add vanilla.",
              "Sift together the flour, salt and baking powder, and add to the creamed mixture alternately with the milk.",
              "Crush 1/2 cup blueberries with a fork, and mix into the batter. Fold in the remaining whole berries.",
              "Line a 12 cup standard muffin tin with cupcake liners, and fill with batter. Sprinkle the 3 teaspoons sugar over the tops of the muffins, and bake at 375 degrees for about 30-35 minutes.",
              "Remove muffins from tin and cool at least 30 minutes. Store, uncovered, or the muffins will be too moist the second day, if they last that long."
          ],
          "author": "Marian Burros",
          "date_added": "2020-12-06",
          "categories": [
              5506,
              5491,
              8724
          ]
      },
      {
          "id": 37437,
          "name": "Spaghetti Carbonara",
          "slug": "12965-spaghetti-carbonara",
          "image_path": "https://imgs.search.brave.com/6Bv9v99NprGHSHeOeL_7Nm_rxKLnM00HrPee9aF_RCU/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDIx/LzAyLzE0L2Rpbmlu/Zy9jYXJib25hcmEt/aG9yaXpvbnRhbC9j/YXJib25hcmEtaG9y/aXpvbnRhbC1hcnRp/Y2xlTGFyZ2UtdjIu/anBnP3dpZHRoPTEy/ODAmcXVhbGl0eT03/NSZhdXRvPXdlYnA",
          "description": "This dish is a deli <a href=\"/#/recipe/1023421-bacon-egg-and-cheese-sandwich\">bacon-egg-and-cheese-on-a-roll</a> that has been pasta-fied, fancified, fetishized and turned into an Italian tradition that, like many inviolate Italian traditions, is actually far less old than the Mayflower. Because America may have contributed to its creation, carbonara is Exhibit A in the back-and-forth between Italy and the United States when it comes to food. Remember: the main goal is creaminess.",
          "total_time_string": "30 minutes",
          "servings": "4 servings",
          "rating_value": 5,
          "rating_count": 12043,
          "ingredients": [
              " Salt",
              "2 large eggs and 2 large yolks, room temperature",
              "1 ounce (about 1/3 packed cup) grated pecorino Romano, plus additional for serving",
              "1 ounce (about 1/3 packed cup) grated Parmesan",
              " Coarsely ground black pepper",
              "1 tablespoon olive oil",
              "3 1/2 ounces of slab guanciale (see <a href=\"/#/recipe/1014345-shortcut-guanciale\">recipe</a>), pancetta or bacon, sliced into pieces about 1/4 inch thick by 1/3 inch square",
              "12 ounces spaghetti (about 3/4 box)"
          ],
          "instructions": [
              "Place a large pot of lightly salted water (no more than 1 tablespoon salt) over high heat, and bring to a boil. Fill a large bowl with hot water for serving, and set aside.",
              "In a <a href='https://www.nytimes.com/wirecutter/reviews/best-mixing-bowls/'>mixing bowl</a>, whisk together the eggs, yolks and pecorino and Parmesan. Season with a pinch of salt and generous black pepper.",
              "Set the water to boil. Meanwhile, heat oil in a large skillet over medium heat, add the pork, and sauté until the fat just renders, on the edge of crispness but not hard. Remove from heat and set aside.",
              "Add pasta to the water and boil until a bit firmer than al dente. Just before pasta is ready, reheat guanciale in skillet, if needed. Reserve 1 cup of pasta water, then drain pasta and add to the skillet over low heat. Stir for a minute or so.",
              "Empty serving bowl of hot water. Dry it and add hot pasta mixture. Stir in cheese mixture, adding some reserved pasta water if needed for creaminess. Serve immediately, dressing it with a bit of additional grated pecorino and pepper."
          ],
          "author": "Ian Fisher",
          "date_added": "2020-12-06",
          "categories": [
              8936,
              9037,
              5492,
              5493,
              8807,
              5464,
              5497,
              9180,
              5534,
              5498,
              8844
          ]
      },
      {
          "id": 36709,
          "name": "Marcella Hazan’s Tomato Sauce",
          "slug": "1015178-marcella-hazans-tomato-sauce",
          "image_path": "https://imgs.search.brave.com/ps2kWD3YPEDnLci8gyjtMxnYcvlzVA514X9BKOh8ivA/rs:fit:860:0:0/g:ce/aHR0cHM6Ly9zdGF0/aWMwMS5ueXQuY29t/L2ltYWdlcy8yMDE1/LzA2LzA4L2Rpbmlu/Zy8wOFRPTUFUT1NB/VUNFLzA4VE9NQVRP/U0FVQ0UtYXJ0aWNs/ZUxhcmdlLmpwZz93/aWR0aD0xMjgwJnF1/YWxpdHk9NzUmYXV0/bz13ZWJw",
          "description": "This is perhaps the most famous recipe created by Marcella Hazan, the cookbook author who changed how Americans cook Italian food. It also may be her easiest. Use your favorite canned tomatoes for this and don’t be scared off by the butter. It gives the sauce an unparalleled velvety richness.",
          "total_time_string": "1 hour",
          "servings": "4 servings",
          "rating_value": 5,
          "rating_count": 11950,
          "ingredients": [
              "2 cups tomatoes, in addition to their juices (for example, a 28-ounce can of San Marzano whole peeled tomatoes)",
              "5 tablespoons butter",
              "1 onion, peeled and cut in half",
              " Salt"
          ],
          "instructions": [
              "Combine the tomatoes, their juices, the butter and the onion halves in a saucepan. Add a pinch or two of salt.",
              "Place over medium heat and bring to a simmer. Cook, uncovered, for about 45 minutes. Stir occasionally, mashing any large pieces of tomato with a spoon. Add salt as needed.",
              "Discard the onion before tossing the sauce with pasta. This recipe makes enough sauce for a pound of pasta."
          ],
          "author": "The New York Times, Kim Severson",
          "date_added": "2020-12-06",
          "categories": [
              8848,
              5493,
              5464,
              9012,
              5498,
              5546,
              8921,
              5437
          ]
      }
      
  ]
}
